#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)



//第一节：绪论部分


//1.3算法设计


//1.算法的定义
    //算法是规则的有限集合，是为解决特定问题而规定的一些列操作

//算法的特性：
//1.有限性：有限步骤之内正常结束，不能形成无穷循环
//2.确定性：算法中的每一步骤必须有确定的含义，无二义性
//3.输入：有多个或0个输入
//4.至少有一个或多个输出（这里输出不一定是在屏幕上打印出来，比如说return x；这种返回带参的也可叫做输出）
//5.可行性：原则上能精确进行，操作可通过已实现的基本运算执行有限次而完成

//其中，最重要的是三大特性：有限性、确定性、可行性


//算法设计的要求：
//1.正确性
//2.可读性
//3.健壮性（鲁棒性）
//4.高效率和低存储



//1.4 描述算法的工具

//算法 + 数据结构 = 程序

//1.5 评价算法的标准
 
//时间T -- 语句执行的次数   -- 使用时间复杂度O 进行评估

//空间S -- 
